http/results/retro2-classic-libev-R5000-r1.txt
Running 20s test @ http://127.0.0.1:19217/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.248ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.374ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.425ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.385ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms    1.22ms  31.92ms   94.90%
    Req/Sec     1.32k   215.11     4.11k    79.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.73ms
 90.000%    2.22ms
 99.000%    5.07ms
 99.900%   18.13ms
 99.990%   30.69ms
 99.999%   31.93ms
100.000%   31.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.089     0.000000            1         1.00
       0.618     0.100000         4936         1.11
       0.814     0.200000         9874         1.25
       0.979     0.300000        14823         1.43
       1.137     0.400000        19774         1.67
       1.290     0.500000        24694         2.00
       1.368     0.550000        27172         2.22
       1.448     0.600000        29623         2.50
       1.534     0.650000        32094         2.86
       1.627     0.700000        34568         3.33
       1.733     0.750000        37024         4.00
       1.791     0.775000        38273         4.44
       1.856     0.800000        39489         5.00
       1.930     0.825000        40729         5.71
       2.009     0.850000        41961         6.67
       2.103     0.875000        43193         8.00
       2.157     0.887500        43834         8.89
       2.217     0.900000        44438        10.00
       2.287     0.912500        45045        11.43
       2.365     0.925000        45664        13.33
       2.467     0.937500        46281        16.00
       2.541     0.943750        46587        17.78
       2.625     0.950000        46898        20.00
       2.725     0.956250        47207        22.86
       2.847     0.962500        47511        26.67
       3.029     0.968750        47825        32.00
       3.127     0.971875        47973        35.56
       3.257     0.975000        48126        40.00
       3.435     0.978125        48281        45.71
       3.683     0.981250        48435        53.33
       4.023     0.984375        48590        64.00
       4.255     0.985938        48667        71.11
       4.595     0.987500        48743        80.00
       4.915     0.989062        48821        91.43
       5.227     0.990625        48898       106.67
       5.607     0.992188        48975       128.00
       5.995     0.992969        49014       142.22
       6.375     0.993750        49052       160.00
       6.787     0.994531        49091       182.86
       7.827     0.995313        49129       213.33
       8.319     0.996094        49168       256.00
       8.639     0.996484        49187       284.44
       9.263     0.996875        49206       320.00
      10.775     0.997266        49226       365.71
      11.607     0.997656        49245       426.67
      12.615     0.998047        49264       512.00
      13.663     0.998242        49274       568.89
      14.359     0.998437        49283       640.00
      15.183     0.998633        49293       731.43
      17.071     0.998828        49303       853.33
      18.335     0.999023        49312      1024.00
      21.631     0.999121        49317      1137.78
      22.047     0.999219        49322      1280.00
      22.383     0.999316        49328      1462.86
      22.719     0.999414        49332      1706.67
      25.503     0.999512        49336      2048.00
      26.271     0.999561        49339      2275.56
      26.511     0.999609        49343      2560.00
      26.799     0.999658        49344      2925.71
      27.215     0.999707        49346      3413.33
      27.375     0.999756        49348      4096.00
      27.439     0.999780        49350      4551.11
      27.455     0.999805        49351      5120.00
      27.487     0.999829        49352      5851.43
      27.519     0.999854        49353      6826.67
      27.551     0.999878        49354      8192.00
      30.687     0.999890        49355      9102.22
      31.423     0.999902        49356     10240.00
      31.423     0.999915        49356     11702.86
      31.647     0.999927        49357     13653.33
      31.647     0.999939        49357     16384.00
      31.807     0.999945        49358     18204.44
      31.807     0.999951        49358     20480.00
      31.807     0.999957        49358     23405.71
      31.919     0.999963        49359     27306.67
      31.919     0.999969        49359     32768.00
      31.919     0.999973        49359     36408.89
      31.919     0.999976        49359     40960.00
      31.919     0.999979        49359     46811.43
      31.935     0.999982        49360     54613.33
      31.935     1.000000        49360          inf
#[Mean    =        1.448, StdDeviation   =        1.217]
#[Max     =       31.920, Total count    =        49360]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99737 requests in 20.00s, 201.46MB read
Requests/sec:   4986.41
Transfer/sec:     10.07MB

JSON Output:
{
	"requests": 99737,
	"duration_in_microseconds": 20001747.00,
	"bytes": 211242966,
	"requests_per_sec": 4986.41,
	"bytes_transfer_per_sec": 10561225.78,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1290
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1733
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 2217
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5071
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 18127
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 30687
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 31935
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 31935
		}
	]
}