http/results/retro2-classic-uring-R20000-r1.txt
Running 20s test @ http://127.0.0.1:19205/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.970ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.104ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 3.724ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 3.717ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.41ms    3.32ms  19.68ms   85.08%
    Req/Sec     5.13k     1.06k    9.20k    75.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.08ms
 75.000%    3.26ms
 90.000%    9.26ms
 99.000%   14.41ms
 99.900%   18.22ms
 99.990%   19.36ms
 99.999%   19.60ms
100.000%   19.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       1.139     0.100000        19775         1.11
       1.416     0.200000        39496         1.25
       1.637     0.300000        59279         1.43
       1.853     0.400000        78989         1.67
       2.079     0.500000        98823         2.00
       2.203     0.550000       108600         2.22
       2.349     0.600000       118559         2.50
       2.533     0.650000       128395         2.86
       2.815     0.700000       138229         3.33
       3.261     0.750000       148109         4.00
       3.619     0.775000       153024         4.44
       4.355     0.800000       157967         5.00
       5.639     0.825000       162885         5.71
       6.691     0.850000       167823         6.67
       8.199     0.875000       172774         8.00
       8.735     0.887500       175255         8.89
       9.255     0.900000       177716        10.00
       9.759     0.912500       180163        11.43
      10.335     0.925000       182629        13.33
      10.839     0.937500       185113        16.00
      11.135     0.943750       186338        17.78
      11.407     0.950000       187582        20.00
      11.679     0.956250       188801        22.86
      12.055     0.962500       190035        26.67
      12.471     0.968750       191289        32.00
      12.671     0.971875       191890        35.56
      12.935     0.975000       192507        40.00
      13.175     0.978125       193132        45.71
      13.407     0.981250       193736        53.33
      13.751     0.984375       194349        64.00
      13.927     0.985938       194659        71.11
      14.095     0.987500       194976        80.00
      14.295     0.989062       195282        91.43
      14.503     0.990625       195584       106.67
      14.783     0.992188       195896       128.00
      14.935     0.992969       196046       142.22
      15.111     0.993750       196202       160.00
      15.287     0.994531       196356       182.86
      15.535     0.995313       196508       213.33
      15.799     0.996094       196662       256.00
      15.967     0.996484       196741       284.44
      16.143     0.996875       196819       320.00
      16.343     0.997266       196894       365.71
      16.543     0.997656       196971       426.67
      16.991     0.998047       197049       512.00
      17.167     0.998242       197089       568.89
      17.375     0.998437       197125       640.00
      17.903     0.998633       197165       731.43
      18.079     0.998828       197202       853.33
      18.239     0.999023       197246      1024.00
      18.303     0.999121       197261      1137.78
      18.351     0.999219       197283      1280.00
      18.431     0.999316       197303      1462.86
      18.527     0.999414       197321      1706.67
      18.783     0.999512       197337      2048.00
      18.895     0.999561       197347      2275.56
      18.943     0.999609       197357      2560.00
      19.039     0.999658       197366      2925.71
      19.119     0.999707       197377      3413.33
      19.167     0.999756       197386      4096.00
      19.199     0.999780       197391      4551.11
      19.231     0.999805       197395      5120.00
      19.263     0.999829       197400      5851.43
      19.295     0.999854       197406      6826.67
      19.327     0.999878       197409      8192.00
      19.359     0.999890       197413      9102.22
      19.391     0.999902       197414     10240.00
      19.407     0.999915       197417     11702.86
      19.487     0.999927       197423     13653.33
      19.487     0.999939       197423     16384.00
      19.487     0.999945       197423     18204.44
      19.519     0.999951       197426     20480.00
      19.519     0.999957       197426     23405.71
      19.519     0.999963       197426     27306.67
      19.535     0.999969       197427     32768.00
      19.551     0.999973       197429     36408.89
      19.551     0.999976       197429     40960.00
      19.551     0.999979       197429     46811.43
      19.583     0.999982       197430     54613.33
      19.583     0.999985       197430     65536.00
      19.599     0.999986       197431     72817.78
      19.599     0.999988       197431     81920.00
      19.599     0.999989       197431     93622.86
      19.615     0.999991       197432    109226.67
      19.615     0.999992       197432    131072.00
      19.615     0.999993       197432    145635.56
      19.615     0.999994       197432    163840.00
      19.615     0.999995       197432    187245.71
      19.695     0.999995       197433    218453.33
      19.695     1.000000       197433          inf
#[Mean    =        3.410, StdDeviation   =        3.315]
#[Max     =       19.680, Total count    =       197433]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  394058 requests in 20.00s, 795.95MB read
Requests/sec:  19705.08
Transfer/sec:     39.80MB

JSON Output:
{
	"requests": 394058,
	"duration_in_microseconds": 19997791.00,
	"bytes": 834614844,
	"requests_per_sec": 19705.08,
	"bytes_transfer_per_sec": 41735351.87,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2079
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 3261
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 9255
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 14415
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 18223
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 19359
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 19599
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 19695
		}
	]
}